I have the same problem, first use step1.tf create vm and I find that virtio slot and disk are not in the same order

[step1.tf.txt](https://github.com/bpg/terraform-provider-proxmox/files/15271052/step1.tf.txt)

<img width="866" alt="1" src="https://github.com/bpg/terraform-provider-proxmox/assets/15212835/8d048886-cd7c-4469-bfe8-7fad1bb47623">

Then change one of the disks, such as set cache on swap, it look liks:
```
# Swap
disk {
  datastore_id = "local-lvm"
  interface    = "virtio1"
  file_format  = "raw"
  size         = 1
  discard      = "on"
  cache        = "unsafe" # <------- Here
}
```

After plan I got
```
  # proxmox_virtual_environment_vm.debian12dev-test must be replaced
-/+ resource "proxmox_virtual_environment_vm" "debian12dev-test" {
      ~ id                      = "109" -> (known after apply)
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
            ],
          - [
              - "192.168.9.6",
            ],
          - [
              - "172.18.1.2",
            ],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [
              - "fe80::be24:11ff:fe7e:d60",
            ],
          - [
              - "fe80::be24:11ff:fed8:68dd",
            ],
        ] -> (known after apply)
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
          - "BC:24:11:7E:0D:60",
          - "BC:24:11:D8:68:DD",
        ] -> (known after apply)
        name                    = "debian12dev-test"
      ~ network_interface_names = [
          - "lo",
          - "eth0",
          - "eth1",
        ] -> (known after apply)
        tags                    = [
            "opentofu",
            "rust",
        ]
      ~ vm_id                   = 109 -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (8 unchanged attributes hidden)
        }

      ~ disk {
          ~ file_format       = "raw" -> (known after apply)
          + file_id           = "nas-pve-data:iso/debian-12-genericcloud-amd64-20240429-1732.img" # forces replacement
          ~ interface         = "virtio1" -> "virtio0"
          ~ path_in_datastore = "vm-109-disk-0" -> (known after apply)
          ~ size              = 1 -> 8
            # (8 unchanged attributes hidden)
        }
      ~ disk {
          ~ cache             = "none" -> "unsafe"
          ~ interface         = "virtio2" -> "virtio1"
          ~ path_in_datastore = "vm-109-disk-1" -> (known after apply)
          ~ size              = 16 -> 1
            # (8 unchanged attributes hidden)
        }
      ~ disk {
          - file_id           = "nas-pve-data:iso/debian-12-genericcloud-amd64-20240429-1732.img" -> null # forces replacement
          ~ interface         = "virtio0" -> "virtio2"
          ~ path_in_datastore = "vm-109-disk-2" -> (known after apply)
          ~ size              = 8 -> 16
            # (9 unchanged attributes hidden)
        }

      ~ initialization {
          - interface         = "ide2" -> null
            # (3 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:7E:0D:60" -> (known after apply)
            # (8 unchanged attributes hidden)
        }
      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:D8:68:DD" -> (known after apply)
            # (8 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy
```

Running it a few times without more changes has a probability of getting the correct result:

```
  # proxmox_virtual_environment_vm.debian12dev-test will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "debian12dev-test" {
        id                      = "109"
        name                    = "debian12dev-test"
        tags                    = [
            "opentofu",
            "rust",
        ]
        # (26 unchanged attributes hidden)

      ~ disk {
          ~ cache             = "none" -> "unsafe"
            # (11 unchanged attributes hidden)
        }

        # (9 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

I can't guess what's causing this, so I'm trying to set up a development environment to debug this problem, but it seems like it's going to take me a long time with no experience
